export type tGroup = {
  "id": number,
  "Группа": string | number,
  "Максимальная популярность": number,
  "Минимальная популярность": number,
  "Средняя популярность": number,
}[];

export const publishers: tGroup = [
  { "id": 1, "Группа": "Activision", "Максимальная популярность": 1000, "Минимальная популярность": 1000, "Средняя популярность": 1000 },
  { "id": 2, "Группа": "Bandai Namco", "Максимальная популярность": 350, "Минимальная популярность": 350, "Средняя популярность": 350 },
  { "id": 3, "Группа": "Blizzard", "Максимальная популярность": 100, "Минимальная популярность": 100, "Средняя популярность": 100 },
  { "id": 4, "Группа": "EA Sports", "Максимальная популярность": 113, "Минимальная популярность": 113, "Средняя популярность": 113 },
  { "id": 5, "Группа": "HoYoverse", "Максимальная популярность": 65, "Минимальная популярность": 65, "Средняя популярность": 65 },
  { "id": 6, "Группа": "InnerSloth", "Максимальная популярность": 485, "Минимальная популярность": 485, "Средняя популярность": 485 },
  { "id": 7, "Группа": "Konami", "Максимальная популярность": 150, "Минимальная популярность": 150, "Средняя популярность": 150 },
  { "id": 8, "Группа": "Moonton", "Максимальная популярность": 150, "Минимальная популярность": 150, "Средняя популярность": 150 },
  { "id": 9, "Группа": "NetEase", "Максимальная популярность": 250, "Минимальная популярность": 250, "Средняя популярность": 250 },
  { "id": 10, "Группа": "Nintendo", "Максимальная популярность": 300, "Минимальная популярность": 124, "Средняя популярность": 212 },
  { "id": 11, "Группа": "Playrix", "Максимальная популярность": 324, "Минимальная популярность": 173, "Средняя популярность": 270 },
  { "id": 12, "Группа": "Rovio", "Максимальная популярность": 230, "Минимальная популярность": 230, "Средняя популярность": 230 },
  { "id": 13, "Группа": "Sega", "Максимальная популярность": 350, "Минимальная популярность": 350, "Средняя популярность": 350 },
  { "id": 14, "Группа": "Supercell", "Максимальная популярность": 50, "Минимальная популярность": 50, "Средняя популярность": 50 },
  { "id": 15, "Группа": "SYBO Games", "Максимальная популярность": 100, "Минимальная популярность": 100, "Средняя популярность": 100 },
  { "id": 16, "Группа": "Tencent", "Максимальная популярность": 300, "Минимальная популярность": 200, "Средняя популярность": 250 },
  { "id": 17, "Группа": "Voodoo", "Максимальная популярность": 334, "Минимальная популярность": 334, "Средняя популярность": 334 },
  { "id": 18, "Группа": "Wargaming", "Максимальная популярность": 140, "Минимальная популярность": 140, "Средняя популярность": 140 },
  { "id": 19, "Группа": "Gameloft", "Максимальная популярность": 120, "Минимальная популярность": 120, "Средняя популярность": 120 },
];

export const years: tGroup = [
  { "id": 1, "Группа": 2008, "Максимальная популярность": 173, "Минимальная популярность": 173, "Средняя популярность": 173 },
  { "id": 2, "Группа": 2010, "Максимальная популярность": 140, "Минимальная популярность": 140, "Средняя популярность": 140 },
  { "id": 3, "Группа": 2012, "Максимальная популярность": 274, "Минимальная популярность": 100, "Средняя популярность": 187 },
  { "id": 4, "Группа": 2013, "Максимальная популярность": 350, "Минимальная популярность": 50, "Средняя популярность": 200 },
  { "id": 5, "Группа": 2014, "Максимальная популярность": 150, "Минимальная популярность": 100, "Средняя популярность": 125 },
  { "id": 6, "Группа": 2015, "Максимальная популярность": 400, "Минимальная популярность": 200, "Средняя популярность": 295 },
  { "id": 7, "Группа": 2016, "Максимальная популярность": 324, "Минимальная популярность": 50, "Средняя популярность": 187 },
  { "id": 8, "Группа": 2017, "Максимальная популярность": 312, "Минимальная популярность": 150, "Средняя популярность": 228 },
  { "id": 9, "Группа": 2018, "Максимальная популярность": 485, "Минимальная популярность": 162, "Средняя популярность": 295 },
  { "id": 10, "Группа": 2019, "Максимальная популярность": 1000, "Минимальная популярность": 124, "Средняя популярность": 562 },
  { "id": 11, "Группа": 2020, "Максимальная популярность": 65, "Минимальная популярность": 65, "Средняя популярность": 65 },
];

export const types: tGroup = [
  { "id": 1, "Группа": "daily players", "Максимальная популярность": 50, "Минимальная популярность": 50, "Средняя популярность": 50 },
  { "id": 2, "Группа": "monthly players", "Максимальная популярность": 300, "Минимальная популярность": 65, "Средняя популярность": 155 },
  { "id": 3, "Группа": "peak daily players", "Максимальная популярность": 150, "Минимальная популярность": 150, "Средняя популярность": 150 },
  { "id": 4, "Группа": "peak monthly players", "Максимальная популярность": 200, "Минимальная популярность": 200, "Средняя популярность": 200 },
  { "id": 5, "Группа": "total downloads", "Максимальная популярность": 1000, "Минимальная популярность": 100, "Средняя популярность": 279 },
];